commands_templates/SetDiscoveryMode0.xml

<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsdl="http://www.onvif.org/ver10/device/wsdl">
   <soap:Header/>
   <soap:Body>
      <wsdl:SetDiscoveryMode>
         <!--type: DiscoveryMode - enumeration: [Discoverable,NonDiscoverable]-->
         <wsdl:DiscoveryMode>?</wsdl:DiscoveryMode>
      </wsdl:SetDiscoveryMode>
   </soap:Body>
</soap:Envelope>